{
  "backend/main.mo": "Motoko canister defining user profiles, study materials, assignments, exams, attendance, notifications, results, and announcements with access‑controlled CRUD-style functions.",
  "feature_evidence.json": "Feature evidence report mapping gallery-related features to the specific frontend files and components they modify.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and functionality of each major frontend file.",
  "frontend/index.css": "Global Tailwind base styles defining color variables, dark mode overrides, and shared element styling.",
  "frontend/index.html": "Main HTML entry point setting up PWA metadata, icons, manifest, and loading the React app root.",
  "frontend/public/manifest.webmanifest": "PWA manifest configuring app name, icons, theme colors, display mode, and startup behavior.",
  "frontend/src/App.tsx": "Root React component managing app-wide section navigation, theming, layout, and shared UI components.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with icons that switches between seven main app sections.",
  "frontend/src/components/Header.tsx": "Top header showing branding and handling Internet Identity login/logout with query cache clearing.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog component that prompts new authenticated users to enter their name and saves the profile via a mutation.",
  "frontend/src/components/QueryState.tsx": "Provides reusable UI components for loading skeletons, empty states, and error states.",
  "frontend/src/constants/branding.ts": "Defines static branding info including school name, location, and logo path.",
  "frontend/src/hooks/queries/auth.ts": "React Query hooks for fetching and saving the current user's profile using the actor API.",
  "frontend/src/hooks/queries/dashboard.ts": "React Query hooks for retrieving student profiles, exam results, and notifications.",
  "frontend/src/hooks/queries/discipline.ts": "React Query hook for fetching attendance records for a student.",
  "frontend/src/hooks/queries/education.ts": "React Query hooks for study materials, assignments, exams, exam results, and announcements.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and identity persistence.",
  "frontend/src/index.css": "Tailwind base styles and custom color variables defining the school's theme for light and dark modes.",
  "frontend/src/main.tsx": "Initializes React root, sets up QueryClientProvider and InternetIdentityProvider, and renders the app.",
  "frontend/src/pages/dashboard/DashboardScreen.tsx": "Fetches user, student, exam, and notification data to render a personalized dashboard with login handling and summary cards.",
  "frontend/src/pages/discipline/AttendanceScreen.tsx": "Displays attendance records and summary for the logged-in student with login checks, loading states, and error handling.",
  "frontend/src/pages/discipline/BehaviorUpdatesScreen.tsx": "Shows a login prompt if unauthenticated and otherwise displays an empty state for behavior updates.",
  "frontend/src/pages/discipline/DisciplineScreen.tsx": "Renders a tabbed interface for rules, attendance, behavior updates, and guidelines sections within the discipline module.",
  "frontend/src/pages/discipline/GuidelinesPoliciesScreen.tsx": "Lists school guidelines and policies in card format with static descriptive content.",
  "frontend/src/pages/discipline/RulesCodeScreen.tsx": "Displays the school code of conduct and a list of rules using styled cards and icons.",
  "frontend/src/pages/education/AnnouncementDetail.tsx": "Shows details for a single teacher announcement with a back button.",
  "frontend/src/pages/education/AnnouncementsList.tsx": "Fetches and displays a list of announcements sorted by date with support for viewing individual announcement details.",
  "frontend/src/pages/education/AssignmentDetail.tsx": "Renders detailed information about a specific assignment, including due date, class, and description, with a back action.",
  "frontend/src/pages/education/AssignmentsList.tsx": "Displays a filterable list of assignments with class selection and detail view navigation.",
  "frontend/src/pages/education/EducationScreen.tsx": "Provides tabbed navigation for study materials, assignments, exams, and announcements.",
  "frontend/src/pages/education/ExamDetail.tsx": "Shows detailed exam information with subject, class, date, and description.",
  "frontend/src/pages/education/ExamsList.tsx": "Lists exams with class filtering, tabs for schedules/results, and navigation to exam details.",
  "frontend/src/pages/education/StudyMaterialDetail.tsx": "Displays detailed study material info including subject, description, class, and optional resource link.",
  "frontend/src/pages/education/StudyMaterialsList.tsx": "Shows a filterable list of study materials and allows navigating to detailed views.",
  "frontend/src/pages/HomeScreen.tsx": "Home screen UI showing a hero banner and quick navigation links using branding and icons.",
  "frontend/src/pages/images/galleryImages.ts": "Defines the GalleryImage interface and exports a static list of gallery image metadata.",
  "frontend/src/pages/images/ImagePreviewDialog.tsx": "Modal dialog for previewing a selected gallery image at large size.",
  "frontend/src/pages/images/ImagesScreen.tsx": "Renders a gallery grid of images with click-to-preview functionality.",
  "frontend/src/pages/notices/CircularDetail.tsx": "Displays detailed circular information including title, date, and message with a back button.",
  "frontend/src/pages/notices/CircularsList.tsx": "Shows a list of circular notices with placeholder data and opens a detail view when one is selected.",
  "frontend/src/pages/notices/EventUpdateDetail.tsx": "Displays the full details of a selected event update with a back button.",
  "frontend/src/pages/notices/EventUpdatesList.tsx": "Lists event updates with placeholder data and opens a detail view on selection.",
  "frontend/src/pages/notices/HolidayList.tsx": "Displays a sorted list of holidays with dates and labels using placeholder data.",
  "frontend/src/pages/notices/NoticesScreen.tsx": "Top-level notices screen with tabs switching between circulars, holidays, and events.",
  "frontend/src/pages/sports/AchievementsGallery.tsx": "Shows a gallery of sports achievements with images and titles.",
  "frontend/src/pages/sports/ActivitiesFacilitiesScreen.tsx": "Displays available sports activities and facilities with icons and descriptions.",
  "frontend/src/pages/sports/FitnessTrainingScreen.tsx": "Shows weekly fitness and training schedules with activities and levels.",
  "frontend/src/pages/sports/SportsScreen.tsx": "Main sports screen providing tabs for activities, events, achievements, and fitness sections.",
  "frontend/src/pages/sports/TournamentEventDetail.tsx": "Displays detailed information for a selected tournament event with title, date, optional location, description, and a back button.",
  "frontend/src/pages/sports/TournamentsEventsList.tsx": "Shows a list of placeholder tournament events with clickable cards and switches to a detail view when an event is selected.",
  "frontend/src/utils/urlParams.ts": "Provides utility helpers for reading, storing, retrieving, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, fonts, animations, and plugin usage for the frontend build.",
  "project_state.json": "Stores project metadata, feature lists, new feature requests, and overall state for the image gallery project."
}