{
  "backend/main.mo": "Defines user profiles and multiple school data models (study materials, assignments, exams, attendance, results, announcements) with access‑controlled CRUD-style functions.",
  "feature_evidence.json": "Lists feature evidence entries describing branding image updates, PWA icon replacements, and in‑app logo path updates with associated files and components.",
  "frontend-file-summaries.txt": "Contains short descriptive summaries of various frontend files, covering global styles, UI components, pages, and configuration.",
  "frontend/index.css": "Defines global Tailwind and OKLCH color variables for light/dark themes along with base element styling.",
  "frontend/index.html": "HTML entry point setting app metadata, linking updated PWA icons, and loading the React client.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying icons, theme colors, app metadata, and maskable icon assets.",
  "frontend/src/App.tsx": "Main React app component handling section navigation, theming, and layout composition with header and bottom navigation.",
  "frontend/src/components/BottomNav.tsx": "Renders fixed bottom navigation with six sections using icon buttons and active-state styling.",
  "frontend/src/components/Header.tsx": "Displays the school logo and handles Internet Identity login/logout with query cache clearing.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog that prompts new authenticated users to enter and save their profile name using react-query mutations.",
  "frontend/src/components/QueryState.tsx": "Reusable UI components for loading skeletons, empty states, and error alerts.",
  "frontend/src/constants/branding.ts": "Exports branding metadata including school name, location, and logo path.",
  "frontend/src/hooks/queries/auth.ts": "React-query hooks for fetching and saving the caller’s user profile via the actor.",
  "frontend/src/hooks/queries/dashboard.ts": "React-query hooks to load student profile, exam results, and notifications from the backend.",
  "frontend/src/hooks/queries/discipline.ts": "Provides a react-query hook to fetch a student's attendance records.",
  "frontend/src/hooks/queries/education.ts": "React-query hooks for study materials, assignments, exams, exam results, and announcements.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor based on Internet Identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, stored identities, and status states.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining the school's color theme and dark mode palette.",
  "frontend/src/main.tsx": "Application entry point that mounts React, sets up the query client, and wraps the app with Internet Identity.",
  "frontend/src/pages/dashboard/DashboardScreen.tsx": "Renders the student dashboard, handling authentication and loading user, student, exam, and notification data with summary cards.",
  "frontend/src/pages/discipline/AttendanceScreen.tsx": "Displays attendance summary and record list for the authenticated student, with loading and error states.",
  "frontend/src/pages/discipline/BehaviorUpdatesScreen.tsx": "Shows a login prompt if unauthenticated and otherwise displays an empty state for behavior updates.",
  "frontend/src/pages/discipline/DisciplineScreen.tsx": "Provides tabbed navigation for rules, attendance, behavior updates, and guidelines sections.",
  "frontend/src/pages/discipline/GuidelinesPoliciesScreen.tsx": "Lists school policies and guidelines in styled cards.",
  "frontend/src/pages/discipline/RulesCodeScreen.tsx": "Shows the school's code of conduct and a list of rules.",
  "frontend/src/pages/education/AnnouncementDetail.tsx": "Displays full details of a selected announcement with a back button.",
  "frontend/src/pages/education/AnnouncementsList.tsx": "Fetches, sorts, and lists announcements with selectable detail view and loading states.",
  "frontend/src/pages/education/AssignmentDetail.tsx": "Shows detailed assignment information including title, class, due date, and description.",
  "frontend/src/pages/education/AssignmentsList.tsx": "Displays assignments with class-based filtering, sorting by due date, and navigation to a detailed view.",
  "frontend/src/pages/education/EducationScreen.tsx": "Provides a tabbed interface for accessing study materials, assignments, exams, and announcements.",
  "frontend/src/pages/education/ExamDetail.tsx": "Shows detailed information about a selected exam including subject, class, date, and description.",
  "frontend/src/pages/education/ExamsList.tsx": "Lists exams with class filtering, schedule/results tabs, and navigation to an exam detail view.",
  "frontend/src/pages/education/StudyMaterialDetail.tsx": "Displays detailed study material information with description and optional resource link.",
  "frontend/src/pages/education/StudyMaterialsList.tsx": "Shows study materials with class filtering and allows opening a detail view for each item.",
  "frontend/src/pages/HomeScreen.tsx": "Home screen UI showing hero branding and quick-access cards for major app sections.",
  "frontend/src/pages/notices/CircularDetail.tsx": "Renders full details of a selected circular including title, date, and message.",
  "frontend/src/pages/notices/CircularsList.tsx": "Lists placeholder circulars and supports navigating to a detailed circular view.",
  "frontend/src/pages/notices/EventUpdateDetail.tsx": "Displays detailed information for a selected event update with title, date, and description.",
  "frontend/src/pages/notices/EventUpdatesList.tsx": "Shows a list of event updates with selectable cards and navigates to a detail view.",
  "frontend/src/pages/notices/HolidayList.tsx": "Renders a sorted list of holidays with dates and labels using card components.",
  "frontend/src/pages/notices/NoticesScreen.tsx": "Provides a tabbed interface for viewing circulars, holidays, and event updates.",
  "frontend/src/pages/sports/AchievementsGallery.tsx": "Displays a gallery of sports achievements with images and titles.",
  "frontend/src/pages/sports/ActivitiesFacilitiesScreen.tsx": "Lists available sports activities and facilities with icons and descriptions.",
  "frontend/src/pages/sports/FitnessTrainingScreen.tsx": "Shows a weekly fitness training schedule with activities, times, and levels.",
  "frontend/src/pages/sports/SportsScreen.tsx": "Provides tab navigation for sports activities, events, achievements, and fitness schedules.",
  "frontend/src/pages/sports/TournamentEventDetail.tsx": "Displays full details for a selected sports tournament event including date, location, and description.",
  "frontend/src/pages/sports/TournamentsEventsList.tsx": "React component showing a list of tournament events with clickable cards that open a detail view using placeholder data.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and sessionStorage parameters, including hash-based query parsing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, shadows, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Project metadata describing branding update tasks, image requirements, and requested features for replacing app icons and logos."
}