{
  "backend/main.mo": "Motoko backend defining user profiles, study materials, assignments, exams, attendance, announcements, and access-controlled CRUD functions.",
  "feature_evidence.json": "Feature evidence report listing implemented branding and logo-update features with related components and test IDs.",
  "frontend-file-summaries.txt": "Aggregated summaries of various frontend files describing UI screens, components, styling, and navigation behavior.",
  "frontend/index.css": "Tailwind base overrides defining OKLCH color variables and dark-mode mappings plus global background and text styling.",
  "frontend/index.html": "Basic HTML shell loading the React app root and main TypeScript entry file.",
  "frontend/src/App.tsx": "Main React component managing section navigation, theming, layout, and global UI elements like header, nav, and dialogs.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar providing section switching with icons and active-state highlighting.",
  "frontend/src/components/Header.tsx": "Top header showing branding and login/logout controls using Internet Identity and react-query cache clearing.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal prompting authenticated users without profiles to enter their name and save a new user profile.",
  "frontend/src/components/QueryState.tsx": "Provides loading skeleton, empty state, and error state UI components.",
  "frontend/src/constants/branding.ts": "Exports centralized branding info like school name, location, and logo path.",
  "frontend/src/hooks/queries/auth.ts": "Defines React Query hooks for fetching and saving the caller's user profile.",
  "frontend/src/hooks/queries/dashboard.ts": "Provides hooks to fetch student profiles, exam results, and notifications via the actor.",
  "frontend/src/hooks/queries/discipline.ts": "Supplies a hook to fetch attendance records for a student.",
  "frontend/src/hooks/queries/education.ts": "Contains hooks for fetching study materials, assignments, exams, exam results, and announcements.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity and invalidates dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context providing login, logout, and identity management with AuthClient.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/dashboard/DashboardScreen.tsx": "Renders the student dashboard, handling authentication, fetching profile, exam results, notifications, and displaying recent data summaries.",
  "frontend/src/pages/discipline/AttendanceScreen.tsx": "Displays attendance records with authentication checks, summary stats, and a sorted list of daily attendance entries.",
  "frontend/src/pages/discipline/BehaviorUpdatesScreen.tsx": "Shows behavior updates, requiring login and otherwise displaying an empty-state message.",
  "frontend/src/pages/discipline/DisciplineScreen.tsx": "Provides a tabbed interface for discipline-related sections including rules, attendance, behavior, and guidelines.",
  "frontend/src/pages/discipline/GuidelinesPoliciesScreen.tsx": "Lists school guidelines and policies in styled cards with titles and descriptions.",
  "frontend/src/pages/discipline/RulesCodeScreen.tsx": "Displays the school code of conduct and a list of detailed school rules.",
  "frontend/src/pages/education/AnnouncementDetail.tsx": "Shows full details of a selected announcement with date and a back button.",
  "frontend/src/pages/education/AnnouncementsList.tsx": "Fetches and displays announcements sorted by date, allowing selection to view details.",
  "frontend/src/pages/education/AssignmentDetail.tsx": "Shows detailed information about a selected assignment including class, due date, and description.",
  "frontend/src/pages/education/AssignmentsList.tsx": "Displays assignments with class filtering, sorting by due date, and navigation to a detailed assignment view.",
  "frontend/src/pages/education/EducationScreen.tsx": "Main education hub with tab navigation between materials, assignments, exams, and announcements.",
  "frontend/src/pages/education/ExamDetail.tsx": "Shows detailed information for a single exam with subject, class, date, and description.",
  "frontend/src/pages/education/ExamsList.tsx": "Lists exams with class filtering, schedules/results tabs, and navigation to exam details.",
  "frontend/src/pages/education/StudyMaterialDetail.tsx": "Displays a study material’s subject, class, description, and optional downloadable resource.",
  "frontend/src/pages/education/StudyMaterialsList.tsx": "Lists study materials filtered by class with navigation to detailed material view.",
  "frontend/src/pages/HomeScreen.tsx": "Renders the home screen with branding, hero section, and quick navigation cards.",
  "frontend/src/pages/notices/CircularDetail.tsx": "Shows detailed view of a circular including title, date, and full message.",
  "frontend/src/pages/notices/CircularsList.tsx": "Renders a list of static circulars with clickable cards to view each in detail.",
  "frontend/src/pages/notices/EventUpdateDetail.tsx": "Displays full details of a selected event update with title, date, description, and a back button.",
  "frontend/src/pages/notices/EventUpdatesList.tsx": "Shows a list of event updates with preview cards and allows selecting an event to view its detailed page.",
  "frontend/src/pages/notices/HolidayList.tsx": "Renders a sorted list of holidays with dates and labels, falling back to an empty state if none exist.",
  "frontend/src/pages/notices/NoticesScreen.tsx": "Main notices screen providing tabs for circulars, holidays, and event updates.",
  "frontend/src/pages/sports/AchievementsGallery.tsx": "Displays a gallery of sports achievements with images and titles.",
  "frontend/src/pages/sports/ActivitiesFacilitiesScreen.tsx": "Lists available sports activities and facilities with icons and brief descriptions.",
  "frontend/src/pages/sports/FitnessTrainingScreen.tsx": "Shows a weekly fitness training schedule with activities, times, and levels.",
  "frontend/src/pages/sports/SportsScreen.tsx": "Main sports screen offering tabs for activities, events, achievements, and fitness.",
  "frontend/src/pages/sports/TournamentEventDetail.tsx": "Displays detailed information about a selected sports tournament event with date, location, and description.",
  "frontend/src/pages/sports/TournamentsEventsList.tsx": "Renders a list of hardcoded sports tournament events and shows a detail view when an event is selected.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based query cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending theme colors, typography, container settings, animations, and custom utilities for the project.",
  "project_state.json": "Metadata describing project state, requirements, existing features, issues, and image needs for the PKM school app."
}