{
  "kind": "build_request",
  "title": "Replace app icon and in-app logo with newly provided image",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-21",
      "text": "Create new square, cleanly-cropped branding images from the user-uploaded logo photos (IMG_20260208_024007233-8.jpg, IMG_20260208_024007233-9.jpg, IMG_20260208_024007233-10.jpg, IMG_20260208_024007233-11.jpg) and add them as static assets under frontend/public/assets/generated. The crop should center the circular school emblem, remove surrounding phone/background borders, and ensure the emblem is fully visible with a small safe padding for maskable icon use.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Replace these app icon to that one i provided"
        ]
      },
      "acceptanceCriteria": [
        "New PNG assets exist under frontend/public/assets/generated with the filenames specified in imageRequirements.required.",
        "The generated icon versions are square, centered, and not visibly skewed; no black phone border/background is included.",
        "The 192x192 and 512x512 icon variants include enough padding to look good as a maskable icon (no important details clipped by rounded masks)."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Update the PWA/browser icon metadata to use the newly generated app icon assets by updating references in frontend/index.html and frontend/public/manifest.webmanifest (replace current references to /assets/generated/pkm-app-icon-2026-v4.dim_192x192.png and /assets/generated/pkm-app-icon-2026-v4.dim_512x512.png).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Replace these app icon to that one i provided"
        ]
      },
      "acceptanceCriteria": [
        "frontend/index.html <link rel='icon'>, shortcut icon, and apple-touch-icon point to the new icon asset filenames.",
        "frontend/public/manifest.webmanifest icons[].src entries point to the new icon asset filenames and keep appropriate sizes/type/purpose.",
        "After build, browser tab favicon and installed PWA icon use the new icon images (not the old v4 assets)."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Replace the two selected in-app logo image elements with the newly provided logo by updating the centralized branding logoPath (frontend/src/constants/branding.ts) so that the Header logo image (/html/body/div/div/header/div/div/img[1]) and the Home hero logo image (/html/body/div/div/main/div/div/div[2]/div/img[1]) render the updated logo asset via BRANDING.logoPath.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Replace these app icon to that one i provided"
        ]
      },
      "acceptanceCriteria": [
        "BRANDING.logoPath is updated to the new logo asset filename.",
        "The Header logo and the Home hero logo display the new logo without layout breakage (maintain object-contain behavior).",
        "No other non-selected images/icons are changed as part of this request."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only UI component sources).",
    "Backend is out of scope; do not change backend/main.mo or add new canisters/services.",
    "Apply UI replacement only to the two selected <img> elements (Header logo and Home hero logo) via the shared BRANDING.logoPath configuration."
  ],
  "nonGoals": [
    "Changing bottom navigation icons or any other UI icons besides the two selected logo <img> elements.",
    "Changing app name, theme colors, or typography.",
    "Adding new authentication methods or any backend feature work."
  ],
  "imageRequirements": {
    "required": [
      "Cleanly cropped square school logo on transparent or clean white background (pkm-school-logo-2026-v3.dim_512x512.png)",
      "Maskable-style square app icon with centered emblem and safe padding (pkm-app-icon-2026-v5.dim_512x512.png)",
      "Small square app icon with centered emblem and safe padding (pkm-app-icon-2026-v5.dim_192x192.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}